Revit 2027 API
BuiltInFailures.FluidFailures.UndefinedFluidType Property
 The fluid type '[Type Name]' is not defined
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UndefinedFluidType { get; }
Public Shared ReadOnly Property UndefinedFluidType As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UndefinedFluidType {
	FailureDefinitionId^ get ();
}
static member UndefinedFluidType : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FluidFailures Class
Autodesk.Revit.DB Namespace